[
  {
    "show": "The Fresh Prince of Bel-Air",
    "character": "Hilary",
    "text": "Hilary: Congratulate me. It took all day but I finally found the perfect pair of alligator pumps to wear to the Save the Everglades rally tonight."
  },
  {
    "show": "Modern Family",
    "character": "Jay",
    "text": "Jay: Gloria, they want me! It's the primo 10:00 p.m. slot. Exactly when people are drunk enough to make bad decisions, but not so drunk they can't read the back of their credit cards."
  },
  {
    "show": "The Goldbergs",
    "character": "Pops",
    "text": "Pops: Poor mustachioed bastard."
  },
  {
    "show": "Boy Meets World",
    "character": "Cory",
    "text": "Cory: They want you to take the rolls!"
  },
  {
    "show": "Scrubs",
    "character": "Elliot",
    "text": "Elliot: J.D., seeing a young doctor do his job is an amazing turn-on for a girl. My dad's a doctor, and I remember how excited I was the first time I saw him work at the hospital. I mean, I didn't want to sleep with him, but there were definitely some complicated feelings. But that's totally normal for an 11-year-old, right? Anyway, yeah... I forget."
  },
  {
    "show": "Frasier",
    "character": "Frasier",
    "text": "Frasier: No, it's called jealousy, Marco. Now you've got to stop spying on your ex-girlfriend and get on with your life. Borrow a page from my book. Ah, move to a new city, a new state. Find out why everybody's talking about Pittsburgh!"
  },
  {
    "show": "Boy Meets World",
    "character": "Angela",
    "text": "Angela: Yes, girl, I am the screamer around here."
  },
  {
    "show": "3rd Rock from the Sun",
    "character": "Dick",
    "text": "Dick: [laughs] Well, sir you know what they say, \"Heir today and gone tomorrow.\" [laughs] Please don't vaporize me."
  },
  {
    "show": "Parks And Recreation",
    "character": "Jerry",
    "text": "Jerry: [aside to camera] This is such a great day. See, at my house, I got a wife and three beautiful daughters. But this trip, it is the one time of year I get to pee standing up."
  },
  {
    "show": "The Office",
    "character": "Michael Scott",
    "text": "Michael Scott: Ah, most honorable Pamela. Not offensive, because that's the way they talk in movies."
  },
  {
    "show": "Boy Meets World",
    "character": "Eric",
    "text": "Eric: Don't hate me because I'm beautiful."
  },
  {
    "show": "Modern Family",
    "character": "Alex",
    "text": "Alex: Call me the periodic table 'cause I got all the metals. Yeah!"
  },
  {
    "show": "Brooklyn Nine-Nine",
    "character": "Sergeant Jeffords",
    "text": "Sergeant Jeffords: Captain, I'm trying to get your account reinstated, but it could take a while. They say they have a lot of Nazi stuff on the front burner."
  },
  {
    "show": "How I Met Your Mother",
    "character": "Barney",
    "text": "Barney: Look at this money! This one has a moose, this one has a beaver, and they all have Elton John on the back."
  },
  {
    "show": "The Goldbergs",
    "character": "Adam",
    "text": "Adam: Ow! Oh. Just poked my eye. Oh. It's okay. I got glasses they protected me."
  },
  {
    "show": "Friends",
    "character": "Phoebe",
    "text": "Phoebe: Okay, let's say I bought a really great pair of shoes. Do you know what I'd hear with every step I took? \"Not mine. Not mine. Not mine.\" Even if I was happy and skipping, I'd hear: \"Not-not mine. Not-not mine. \""
  },
  {
    "show": "Boy Meets World",
    "character": "Mr. Feeny",
    "text": "Mr. Feeny: How blissful it must be for you to have lived so little and yet already reached your conclusions about the greatest wonder of the universe."
  },
  {
    "show": "Scrubs",
    "character": "Lucy",
    "text": "Lucy: I met Ben on my first day of med school at a moment when I wasn't really sure if I would make it. But the truth is, I didn't really know Ben. In life, I'm sure he had his faults, but in death, he did great things. He brought us together and helped us realize that we couldn't do it all on our own. He gave us the confidence to believe in ourselves. And he gave his body so that we could become doctors. And for that, we thank him."
  },
  {
    "show": "Friends",
    "character": "Ross",
    "text": "Ross: I'm gonna go kiss Ben good night. I can't believe he thinks I'm a cowboy. I would make a good cowboy."
  }
]
